{
  "hadiths": [
    {
      "id": 1,
      "arabic": "إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى",
      "urdu": "اعمال کا دارومدار نیتوں پر ہے۔ ہر شخص کو وہی ملے گا جس کی اس نے نیت کی۔",
      "reference": "صحیح بخاری، کتاب الایمان",
      "category": "اخلاق"
    },
    {
      "id": 2,
      "arabic": "الدين النصيحة",
      "urdu": "دین خیرخواہی کا نام ہے۔",
      "reference": "صحیح مسلم، کتاب الایمان",
      "category": "اخلاق"
    },
    {
      "id": 3,
      "arabic": "لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه",
      "urdu": "تم میں سے کوئی شخص اس وقت تک مومن نہیں ہو سکتا جب تک کہ اپنے بھائی کے لیے وہی پسند نہ کرے جو اپنے لیے پسند کرتا ہے۔",
      "reference": "صحیح بخاری، کتاب الایمان",
      "category": "اخلاق"
    },
    {
      "id": 4,
      "arabic": "الكلمة الطيبة صدقة",
      "urdu": "اچھی بات کہنا بھی صدقہ ہے۔",
      "reference": "صحیح بخاری، کتاب الادب",
      "category": "اخلاق"
    },
    {
      "id": 5,
      "arabic": "تبسمك في وجه أخيك صدقة",
      "urdu": "اپنے بھائی کے سامنے مسکرانا بھی صدقہ ہے۔",
      "reference": "ترمذی، کتاب البر والصلة",
      "category": "اخلاق"
    },
    {
      "id": 6,
      "arabic": "من كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليصمت",
      "urdu": "جو شخص اللہ اور یوم آخرت پر ایمان رکھتا ہو اسے چاہیے کہ اچھی بات کہے یا خاموش رہے۔",
      "reference": "صحیح بخاری، کتاب الادب",
      "category": "اخلاق"
    },
    {
      "id": 7,
      "arabic": "الملائكة تصلي على أحدكم ما دام في مصلاه ما لم يحدث: اللهم اغفر له اللهم ارحمه",
      "urdu": "فرشتے تم میں سے ہر ایک کے لیے اس وقت تک دعا کرتے رہتے ہیں جب تک وہ اپنی نماز کی جگہ پر ہوتا ہے، جب تک وہ حدث (وضو توڑنے والی چیز) نہ کرے: اے اللہ اسے بخش دے، اے اللہ اس پر رحم فرما۔",
      "reference": "صحیح بخاری، کتاب الصلاة",
      "category": "نماز"
    },
    {
      "id": 8,
      "arabic": "أول ما يحاسب به العبد يوم القيامة الصلاة، فإن صلحت صلح سائر عمله، وإن فسدت فسد سائر عمله",
      "urdu": "قیامت کے دن بندے سے سب سے پہلے نماز کا حساب لیا جائے گا، اگر نماز درست ہوئی تو اس کے تمام اعمال درست ہوں گے اور اگر نماز خراب ہوئی تو اس کے تمام اعمال خراب ہوں گے۔",
      "reference": "طبرانی، المعجم الاوسط",
      "category": "نماز"
    },
    {
      "id": 9,
      "arabic": "بين الرجل وبين الشرك والكفر ترك الصلاة",
      "urdu": "آدمی اور شرک و کفر کے درمیان نماز کا چھوڑنا حائل ہے۔",
      "reference": "صحیح مسلم، کتاب الایمان",
      "category": "نماز"
    },
    {
      "id": 10,
      "arabic": "الصلاة نور",
      "urdu": "نماز نور ہے۔",
      "reference": "صحیح مسلم، کتاب الطہارة",
      "category": "نماز"
    },
    {
      "id": 11,
      "arabic": "من صلى البردين دخل الجنة",
      "urdu": "جو شخص فجر اور عصر کی نماز پڑھے گا وہ جنت میں داخل ہوگا۔",
      "reference": "صحیح بخاری، کتاب مواقیت الصلاة",
      "category": "نماز"
    },
    {
      "id": 12,
      "arabic": "الصوم جنة",
      "urdu": "روزہ ڈھال ہے۔",
      "reference": "صحیح بخاری، کتاب الصوم",
      "category": "روزہ"
    },
    {
      "id": 13,
      "arabic": "من صام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه",
      "urdu": "جو شخص ایمان اور ثواب کی نیت سے رمضان کے روزے رکھے گا، اس کے پچھلے گناہ معاف کر دیے جائیں گے۔",
      "reference": "صحیح بخاری، کتاب الصوم",
      "category": "روزہ"
    },
    {
      "id": 14,
      "arabic": "إذا جاء رمضان فتحت أبواب الجنة وغلقت أبواب النار وصفدت الشياطين",
      "urdu": "جب رمضان آتا ہے تو جنت کے دروازے کھول دیے جاتے ہیں، جہنم کے دروازے بند کر دیے جاتے ہیں اور شیطانوں کو جکڑ دیا جاتا ہے۔",
      "reference": "صحیح بخاری، کتاب الصوم",
      "category": "روزہ"
    },
    {
      "id": 15,
      "arabic": "للصائم فرحتان يفرحهما: إذا أفطر فرح بفطره، وإذا لقي ربه فرح بصومه",
      "urdu": "روزہ دار کے لیے دو خوشیاں ہیں: ایک جب وہ افطار کرتا ہے تو افطار کی خوشی ہوتی ہے، اور دوسری جب وہ اپنے رب سے ملے گا تو روزہ کی خوشی ہوگی۔",
      "reference": "صحیح بخاری، کتاب الصوم",
      "category": "روزہ"
    },
    {
      "id": 16,
      "arabic": "من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه",
      "urdu": "جو شخص ایمان اور ثواب کی نیت سے رمضان میں قیام کرے گا (تراویح پڑھے گا)، اس کے پچھلے گناہ معاف کر دیے جائیں گے۔",
      "reference": "صحیح بخاری، کتاب صلاة التراويح",
      "category": "روزہ"
    },
    {
      "id": 17,
      "arabic": "من قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه",
      "urdu": "جو شخص ایمان اور ثواب کی نیت سے شب قدر میں قیام کرے گا، اس کے پچھلے گناہ معاف کر دیے جائیں گے۔",
      "reference": "صحیح بخاری، کتاب فضل ليلة القدر",
      "category": "روزہ"
    },
    {
      "id": 18,
      "arabic": "الزكاة مطهرة",
      "urdu": "زکوٰۃ پاکیزگی کا ذریعہ ہے۔",
      "reference": "صحیح مسلم، کتاب الزكاة",
      "category": "زکوٰۃ"
    },
    {
      "id": 19,
      "arabic": "ما نقص مال من صدقة",
      "urdu": "صدقہ کرنے سے مال کم نہیں ہوتا۔",
      "reference": "صحیح مسلم، کتاب الزكاة",
      "category": "زکوٰۃ"
    },
    {
      "id": 20,
      "arabic": "اتقوا النار ولو بشق تمرة",
      "urdu": "جہنم سے بچو، چاہے آدھی کھجور کے صدقہ سے ہی کیوں نہ ہو۔",
      "reference": "صحیح بخاری، کتاب الزكاة",
      "category": "زکوٰۃ"
    },
    {
      "id": 21,
      "arabic": "من تصدق بعدل تمرة من كسب طيب، ولا يقبل الله إلا الطيب، فإن الله يتقبلها بيمينه، ثم يربيها لصاحبها كما يربي أحدكم فَلُوَّهُ حتى تكون مثل الجبل",
      "urdu": "جو شخص پاکیزہ کمائی سے ایک کھجور کے برابر بھی صدقہ کرے گا، اور اللہ پاکیزہ چیز ہی قبول کرتا ہے، تو اللہ اسے اپنے دائیں ہاتھ میں لے لے گا، پھر اسے بڑھاتا رہے گا جیسے تم میں سے کوئی اپنے بچھڑے کو پالتا ہے یہاں تک کہ وہ پہاڑ کے برابر ہو جائے۔",
      "reference": "صحیح بخاری، کتاب الزكاة",
      "category": "زکوٰۃ"
    },
    {
      "id": 22,
      "arabic": "سبعة يظلهم الله في ظله يوم لا ظل إلا ظله: الإمام العادل، وشاب نشأ في عبادة الله، ورجل قلبه معلق في المساجد، ورجلان تحابا في الله اجتمعا عليه وتفرقا عليه، ورجل دعته امرأة ذات منصب وجمال فقال إني أخاف الله، ورجل تصدق بصدقة فأخفاها حتى لا تعلم شماله ما تنفق يمينه، ورجل ذكر الله خاليا ففاضت عيناه",
      "urdu": "سات قسم کے لوگ ہیں جنہیں اللہ اپنے سایہ میں رکھے گا جس دن اس کے سایہ کے علاوہ کوئی سایہ نہ ہوگا: عادل حکمران، وہ نوجوان جو اللہ کی عبادت میں پلا بڑھا ہو، وہ شخص جس کا دل مسجد سے لگا ہوا ہو، دو آدمی جو اللہ کے لیے محبت کرتے ہوں، اللہ کے لیے ملتے ہوں اور اللہ کے لیے جدا ہوتے ہوں، وہ شخص جسے کوئی خوبصورت اور عالی مرتبت عورت برائی کی دعوت دے تو وہ کہے کہ میں اللہ سے ڈرتا ہوں، وہ شخص جو خفیہ طور پر صدقہ کرے کہ اس کا بایاں ہاتھ بھی نہ جانے کہ دایاں ہاتھ کیا خرچ کر رہا ہے، اور وہ شخص جو تنہائی میں اللہ کو یاد کرے اور اس کی آنکھیں بہہ جائیں۔",
      "reference": "صحیح بخاری، کتاب الزكاة",
      "category": "اخلاق"
    },
    {
      "id": 23,
      "arabic": "من بنى مسجدا يبتغي به وجه الله بنى الله له بيتا في الجنة",
      "urdu": "جو شخص اللہ کی رضا کے لیے مسجد بنائے گا، اللہ اس کے لیے جنت میں گھر بنائے گا۔",
      "reference": "صحیح بخاری، کتاب الصلاة",
      "category": "نماز"
    },
    {
      "id": 24,
      "arabic": "من غدا إلى المسجد أو راح أعد الله له نزلا في الجنة كلما غدا أو راح",
      "urdu": "جو شخص صبح یا شام مسجد جاتا ہے، اللہ اس کے لیے جنت میں مہمان خانہ تیار کرتا ہے جب بھی وہ جاتا ہے۔",
      "reference": "صحیح بخاری، کتاب الصلاة",
      "category": "نماز"
    }
  ]
}
